#+TITLE: Emacs Config File
#+AUTHOR: me
#+PROPERTY: header-args:emacs-lisp :tangle ~/.emacs.d/init.el
*** templates
#+begin_src emacs-lisp
  (define-key global-map "\C-cc" 'org-capture)
    (setq org-capture-templates '(
	("j" "Journal file")
	("jt" "Task" entry (file+olp "~/org/journal.org" "Daily") "** TODO %?\n %i\n %a\n")
	("je" "Event" entry (file+datetree "~/org/journal.org" "Daily") "** %?\n %^\n %i\n %a\n")
	("l" "Logging")
	("lw" "Weight Entry" table-line (file+headline "~/org/notes.org" "Weight" ) "| %u | %^{weight|170lbs} | %^{phase|MainGain|Bulk|Cut} |")
	("lr" "Run entry" table-line (file+headline "~/org/notes.org" "Runs") "| %u | %^{time} | %^{distance|10km|5km|1km} |")
	("n" "Notes")
	("nm" "Misc Notes" entry (file+headline "~/org/notes.org" "Misc") "*** %?\n %i\n %a\n")
	("r" "Recipe" entry (file+headline "~/org/notes.org" "Recipes") "** %^{recipe-name} %^g \n [[%^{recipe-link}][recipe link]]\n - Ingredients \n  - %? \n- Instructions"
				)))
#+end_src

#+RESULTS:
| j  | Journal file |       |                                                                                                      |            |
| jt | Task         | entry | (file+olp ~/org/journal.org Daily `(format-time-string (car org-time-stamp-formats) (current-time))) | ** TODO %? |


